var store = [{
        "title": "Обзор Concurrency in C# CookBook",
        "excerpt":"Не смог пройти мимо такой книги. Совершенно случайно увидел ее и сразу захотел прочитать. Собственно через пару дней она уже была у меня. И через 3 дня она закончилась. О книге Полное название книги: Concurrency in C# Cookbook: Asynchronous, Parallel, and Multithreaded Programming 2nd Edition за авторством Stephen Cleary Книга...","categories": [],
        "tags": ["Книги"],
        "url": "vladar107.github.io/blog/concurrency-cookbook",
        "teaser": null
      },{
        "title": "Надо ли развиваться самому?",
        "excerpt":"В последнее время довольно часто приходилось слышать, что работодатель заставляет развиваться, и пугает санкциями, если работник не будет развиваться. Зачем мне развиваться? Начну с немного клешированной фразы - мир не стоит на месте, а особенно мир IT. Технологии сменяют друг друга. Появляются новые подходы, технологии, инструменты. И эти новшества планомерно...","categories": [],
        "tags": ["Саморазвитие"],
        "url": "vladar107.github.io/blog/self-improvement",
        "teaser": null
      },{
        "title": "IOptions VS IOptionsSnapshot VS IOptionsMonitor",
        "excerpt":"Во время разработки часто возникает потребность для вынесения параметров в конфигурационные файлы. Да и вообще - хранить разные конфигурационный константы в коде является признаком дурного тона. Один из вариантов хранения настроек - использования конфигурационных файлов. .Net Core из коробки умеет работать с такими форматами как: json, ini, xml и другие....","categories": [],
        "tags": ["DotNetCore"],
        "url": "vladar107.github.io/blog/settings-dotnet-core",
        "teaser": null
      }]
